//Виведення на екран чисел від 1 до 10 за допомогою циклу while:
/* let i = 1;
while (i <= 10) {
    console.log(i);
    i++;
} */

//Виведення на екран всіх парних чисел від 2 до 20 за допомогою циклу for, пропускаючи парні числа за допомогою continue:
/* for (let i = 2; i <= 20; i += 2) {
  if (i % 2 === 0) {
      console.log(i);
      continue;
  }
} */

//Виведення на екран таблиці множення числа 7 за допомогою циклу for:
/* const number = 7;
for (let i = 1; i <= 10; i++) {
    console.log(`${number} * ${i} = ${number * i}`);
} */

//Виведення на екран всіх чисел від 1 до 10, крім числа 7, і закінчення циклу при зустрічі числа 7 за допомогою оператора break:
/* for (let i = 1; i <= 10; i++) {
  if (i === 7) {
      break;
  }
  console.log(i);
} */

//Створення скрипта, який виводить на екран всі числа менші за n, а якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break:
/* const n = 15;
for (let i = 1; i < n; i++) {
    if (i >= n) {
        break;
    }
    console.log(i);
} */

//Виведення на екран всіх чисел від 1 до 20, крім чисел, кратних 3, за допомогою оператора continue:
/* let i = 1;
while (i <= 20) {
    if (i % 3 === 0) {
        i++;
        continue;
    }
    console.log(i);
    i++;
}
 */